brew "antidote"
brew "jq"
brew "spaceship"
brew "starship"
brew "uv"
brew "wget"
cask "font-victor-mono-nerd-font"
vscode "akamud.vscode-theme-onedark"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-vscode.extension-test-runner"
vscode "openai.chatgpt"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "tyriar.sort-lines"
vscode "whizkydee.material-palenight-theme"
